## 数据清理和准备

### 处理缺失数据

In [3]:
import numpy as np
import pandas as pd

float_data = pd.Series([1, 2, np.nan, 4, 5])
float_data

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
dtype: float64

In [4]:
float_data.isna()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [5]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, None])
string_data

0     aardvark
1    artichoke
2          NaN
3         None
dtype: object

In [6]:
string_data.isna()

0    False
1    False
2     True
3     True
dtype: bool

In [7]:
float_data = pd.Series([1.2, -0.1, -2.5, 3.6, -1.4, 4.0, -2.1, None], dtype='float64')
float_data

0    1.2
1   -0.1
2   -2.5
3    3.6
4   -1.4
5    4.0
6   -2.1
7    NaN
dtype: float64

In [8]:
float_data.isna()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
dtype: bool

In [9]:
data = pd.Series([1, np.nan, 'hello', None])
data.dtype
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [10]:
data.dropna()

0        1
2    hello
dtype: object

In [11]:
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [12]:
data[data.notna()]

0        1
2    hello
dtype: object

In [13]:
data = pd.DataFrame([[1., 6.5, 3., 4.], [1., np.nan, 3., 4.], [np.nan, np.nan, np.nan, np.nan]])
data

     0    1    2    3
0  1.0  6.5  3.0  4.0
1  1.0  NaN  3.0  4.0
2  NaN  NaN  NaN  NaN

In [14]:
data.dropna()

     0    1    2    3
0  1.0  6.5  3.0  4.0

In [15]:
data.dropna(axis='columns')

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [16]:
data[5] = np.nan
data

     0    1    2    3   5
0  1.0  6.5  3.0  4.0 NaN
1  1.0  NaN  3.0  4.0 NaN
2  NaN  NaN  NaN  NaN NaN

In [17]:
data.dropna(axis='columns', how='all')

     0    1    2    3
0  1.0  6.5  3.0  4.0
1  1.0  NaN  3.0  4.0
2  NaN  NaN  NaN  NaN

In [18]:
data.dropna(axis="index", how="all")

     0    1    2    3   5
0  1.0  6.5  3.0  4.0 NaN
1  1.0  NaN  3.0  4.0 NaN

In [19]:
df = pd.DataFrame(np.random.standard_normal((7, 3)))
df

          0         1         2
0  0.323615 -1.008981  0.937935
1 -2.201452  1.545773 -2.016665
2 -0.427758 -2.529825  0.936888
3  1.197907  0.336025 -0.393019
4  1.416144 -0.496320  0.104679
5  1.664880  2.012233 -0.515692
6  0.662407  0.230486  1.260531

In [20]:
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan
df

          0         1         2
0  0.323615       NaN       NaN
1 -2.201452       NaN       NaN
2 -0.427758       NaN  0.936888
3  1.197907       NaN -0.393019
4  1.416144 -0.496320  0.104679
5  1.664880  2.012233 -0.515692
6  0.662407  0.230486  1.260531

In [21]:
df.dropna()

          0         1         2
4  1.416144 -0.496320  0.104679
5  1.664880  2.012233 -0.515692
6  0.662407  0.230486  1.260531

In [22]:
df.dropna(thresh=2)

          0         1         2
2 -0.427758       NaN  0.936888
3  1.197907       NaN -0.393019
4  1.416144 -0.496320  0.104679
5  1.664880  2.012233 -0.515692
6  0.662407  0.230486  1.260531

In [23]:
df.fillna(0)

          0         1         2
0  0.323615  0.000000  0.000000
1 -2.201452  0.000000  0.000000
2 -0.427758  0.000000  0.936888
3  1.197907  0.000000 -0.393019
4  1.416144 -0.496320  0.104679
5  1.664880  2.012233 -0.515692
6  0.662407  0.230486  1.260531

In [24]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.323615  0.500000  0.000000
1 -2.201452  0.500000  0.000000
2 -0.427758  0.500000  0.936888
3  1.197907  0.500000 -0.393019
4  1.416144 -0.496320  0.104679
5  1.664880  2.012233 -0.515692
6  0.662407  0.230486  1.260531

In [25]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))
df.iloc[2:, 1] = np.nan
df.iloc[4:, 2] = np.nan
df

          0         1         2
0  0.925570 -0.308227  2.098157
1 -1.240745 -1.586541 -0.279067
2 -0.896725       NaN -1.141119
3  1.716061       NaN  0.108361
4 -0.175459       NaN       NaN
5  0.580166       NaN       NaN

In [26]:
df.fillna(method='ffill')

/var/folders/7v/zmfj4myd5gj8ttpbq6ynmdm80000gn/T/ipykernel_76290/1193302488.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

          0         1         2
0  0.925570 -0.308227  2.098157
1 -1.240745 -1.586541 -0.279067
2 -0.896725 -1.586541 -1.141119
3  1.716061 -1.586541  0.108361
4 -0.175459 -1.586541  0.108361
5  0.580166 -1.586541  0.108361

In [27]:
df.ffill(limit=2)

          0         1         2
0  0.925570 -0.308227  2.098157
1 -1.240745 -1.586541 -0.279067
2 -0.896725 -1.586541 -1.141119
3  1.716061 -1.586541  0.108361
4 -0.175459       NaN  0.108361
5  0.580166       NaN  0.108361

In [28]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

### 数据转换

In [29]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [30]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [31]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [32]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [33]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [34]:
data = pd.DataFrame({
    "food": ["bacon", "pulled pork", "bacon", "Pastrami", "corned beef", "Bacon", "pastrami", "honey ham", "nova lox"],
    "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]
})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [35]:
meet_to_animal = {
    "bacon": "pig",
    "pulled pork": "pig",
    "pastrami": "cow",
    "corned beef": "cow",
    "honey ham": "pig",
    "nova lox": "salmon"
}

data['animal'] = data['food'].str.lower().map(meet_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [36]:
def get_animal(food):
    return meet_to_animal[food.lower()]

data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [37]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [38]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [39]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [40]:
data.replace([-999, -1000], [np.nan, 'NAN~~'])

0      1.0
1      NaN
2      2.0
3      NaN
4    NAN~~
5      3.0
dtype: object

In [41]:
data.replace({
    -999: np.nan,
    -1000: 0
})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [42]:
data = pd.DataFrame(np.arange(12).reshape(3, 4), index=['Ohio', 'Colorado', 'New York'], columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [43]:
def transform(x):
    return x[:4].upper()

data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [44]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [45]:
data.rename(index={
    'OHIO': 'INDIANA',
}, columns={
    'three': 'peekaboo'
})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [46]:
ages =  [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
age_categories = pd.cut(ages, bins)
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [47]:
age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [48]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [49]:
age_categories.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [50]:
data = np.random.uniform(size=20)
result = pd.cut(data, 4, precision=2)
result.value_counts()

(0.025, 0.27]    7
(0.27, 0.51]     2
(0.51, 0.75]     6
(0.75, 0.99]     5
Name: count, dtype: int64

In [51]:
data = np.random.standard_normal(1000)
quartiles = pd.qcut(data, 4, precision=2)
quartiles.value_counts()

(-3.4699999999999998, -0.66]    250
(-0.66, 0.028]                  250
(0.028, 0.67]                   250
(0.67, 3.27]                    250
Name: count, dtype: int64

In [52]:
data = pd.DataFrame(np.random.standard_normal((1000, 4)))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.008836    -0.008305     0.019657    -0.025653
std       0.983605     1.018338     0.997777     1.017193
min      -2.765561    -3.032027    -2.876364    -3.178625
25%      -0.689477    -0.703232    -0.671752    -0.710331
50%       0.024149    -0.015320    -0.006215    -0.000057
75%       0.696081     0.713589     0.686601     0.623667
max       2.983501     3.269192     3.744146     3.138646

In [53]:
col = data[2]
col[col.abs() > 3]

3      3.744146
451    3.052852
982    3.453179
Name: 2, dtype: float64

In [54]:
data[(data.abs() > 3).any(axis="columns")]

            0         1         2         3
3   -1.284296 -1.587662  3.744146 -1.482160
390 -1.465031  1.171582 -1.036663  3.138646
451 -0.667537 -0.626354  3.052852  0.847958
626 -1.030279 -3.032027  0.561745  1.020978
629 -0.780996 -0.824429  0.134870 -3.121798
665  0.716402  1.588972 -1.320027 -3.178625
967 -0.354352  3.269192 -0.356286  0.286673
982  0.571051 -1.429557  3.453179 -0.603977

In [55]:
data[data.abs() > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.008836    -0.008543     0.018407    -0.025491
std       0.983605     1.017411     0.993647     1.015868
min      -2.765561    -3.000000    -2.876364    -3.000000
25%      -0.689477    -0.703232    -0.671752    -0.710331
50%       0.024149    -0.015320    -0.006215    -0.000057
75%       0.696081     0.713589     0.686601     0.623667
max       2.983501     3.000000     3.000000     3.000000

In [56]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0  1.0 -1.0
1 -1.0  1.0 -1.0  1.0
2 -1.0  1.0 -1.0 -1.0
3 -1.0 -1.0  1.0 -1.0
4  1.0 -1.0 -1.0 -1.0

In [57]:
df = pd.DataFrame({
    "key": ["a", "b", "a", "a", "b", "c"],
    "data1": range(6)
})
pd.get_dummies(df["key"])

       a      b      c
0   True  False  False
1  False   True  False
2   True  False  False
3   True  False  False
4  False   True  False
5  False  False   True

In [58]:
dummies = pd.get_dummies(df["key"], prefix="key")
df_with_dummy = df[["key"]].join(dummies)
df_with_dummy

  key  key_a  key_b  key_c
0   a   True  False  False
1   b  False   True  False
2   a   True  False  False
3   a   True  False  False
4   b  False   True  False
5   c  False  False   True

In [59]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('datasets/movielens/movies.dat', sep='::', header=None, names=mnames, engine='python')
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [60]:
dummies = movies['genres'].str.get_dummies("|")
dummies.iloc[:10, :6]

   Action  Adventure  Animation  Children's  Comedy  Crime
0       0          0          1           1       1      0
1       0          1          0           1       0      0
2       0          0          0           0       1      0
3       0          0          0           0       1      0
4       0          0          0           0       1      0
5       1          0          0           0       0      1
6       0          0          0           0       1      0
7       0          1          0           1       0      0
8       1          0          0           0       0      0
9       1          1          0           0       0      0

In [61]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Action                                   0
Genre_Adventure                                0
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Crime                                    0
Genre_Documentary                              0
Genre_Drama                                    0
Genre_Fantasy                                  0
Genre_Film-Noir                                0
Genre_Horror                                   0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Romance                                  0
Genre_Sci-Fi                                   0
Genre_Thriller                                 0
Genre_War                                      0
Genre_Western                                  0
Name: 0, dtype: object

In [62]:
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [63]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0       False       False       False       False        True
1       False        True       False       False       False
2        True       False       False       False       False
3       False        True       False       False       False
4       False       False        True       False       False
5       False       False        True       False       False
6       False       False       False       False        True
7       False       False       False        True       False
8       False       False       False        True       False
9       False       False       False        True       False

### 扩展数据类型

In [64]:
s = pd.Series([1, 2, 3, None])
s

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [65]:
s = pd.Series([1, 2, 3, None], dtype=pd.Int64Dtype())
s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [66]:
s[3] is pd.NA

True

In [67]:
s = pd.Series(["one", "two", "three", None], dtype=pd.StringDtype())
s

0      one
1      two
2    three
3     <NA>
dtype: string

### 字符串操作

In [68]:
val = "a, b, cc, d"
pieces = [x.strip() for x in val.split(",")]
pieces

['a', 'b', 'cc', 'd']

In [69]:
first, second, third, fourth = pieces
first + "::" + second + "::" + third + "::" + fourth

'a::b::cc::d'

In [70]:
"::".join(pieces)

'a::b::cc::d'

In [71]:
"cc" in val

True

In [72]:
val.index(",")

1

In [73]:
val.find(":")

-1

index 和 find 的区别，index 找不到会抛出错误，而find找不到会返回-1

In [74]:
val.count(",")

3

In [75]:
import re

text = "foo = 23 + 42 * 10"
re.split(r"\s+", text)

['foo', '=', '23', '+', '42', '*', '10']

In [76]:
regex = re.compile(r"\s+")
regex.split(text)

['foo', '=', '23', '+', '42', '*', '10']

In [77]:
regex.findall(text)

[' ', ' ', ' ', ' ', ' ', ' ']

In [78]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
regex = re.compile(pattern, flags=re.IGNORECASE)
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [79]:
m = regex.search(text)
text[m.start():m.end()]

'dave@google.com'

In [80]:
print(regex.match(text))

None

In [81]:
print(regex.sub("REDACTED", text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [82]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"
regex = re.compile(pattern, flags=re.IGNORECASE)
m = regex.match("wesm@bright.net")
m.groups()

('wesm', 'bright', 'net')

In [83]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [84]:
print(regex.sub(r"Username: \1, Domain: \2, Suffix: \3", text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [85]:
data = {
    "Dave": "dave@google.com",
    "Steve": "steve@gmail.com",
    "Rob": "rob@gmail.com",
    "Wes": "wes@google.com",
    "Katie": "katie@gmail.com",
    "Wesley": np.nan,
}

data = pd.Series(data)
data

Dave      dave@google.com
Steve     steve@gmail.com
Rob         rob@gmail.com
Wes        wes@google.com
Katie     katie@gmail.com
Wesley                NaN
dtype: object

In [86]:
data.str.contains("gmail")

Dave      False
Steve      True
Rob        True
Wes       False
Katie      True
Wesley      NaN
dtype: object

In [87]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
data.str.findall(pattern, flags=re.IGNORECASE)

Dave      [(dave, google, com)]
Steve     [(steve, gmail, com)]
Rob         [(rob, gmail, com)]
Wes        [(wes, google, com)]
Katie     [(katie, gmail, com)]
Wesley                      NaN
dtype: object

In [88]:
data.str[:5]

Dave      dave@
Steve     steve
Rob       rob@g
Wes       wes@g
Katie     katie
Wesley      NaN
dtype: object

In [89]:
data.str.extract(pattern, flags=re.IGNORECASE)

            0       1    2
Dave     dave  google  com
Steve   steve   gmail  com
Rob       rob   gmail  com
Wes       wes  google  com
Katie   katie   gmail  com
Wesley    NaN     NaN  NaN

### 分类数据

In [90]:
values = pd.Series(['apple', 'orange', 'apple', 'apple'] * 2)
values.unique()

array(['apple', 'orange'], dtype=object)

In [91]:
values.value_counts()

apple     6
orange    2
Name: count, dtype: int64

In [ ]:
fruits = ['apple', 'banana', 'pear', 'strawberry'] * 2
N = len(fruits)
rng = np.random.default_rng(seed=123)
df = pd.DataFrame({
    "fruit": fruits,
    "basket_id": np.arange(N),
    "count": rng.integers(3, 15, size=N),
    "weight": rng.uniform(0, 4, size=N),
}, columns=["basket_id", "fruit", "count", "weight"])

df

   basket_id       fruit  count    weight
0          0       apple      3  0.703624
1          1      banana     11  3.248378
2          2        pear     10  3.693380
3          3  strawberry      3  1.106298
4          4       apple     13  3.279018
5          5      banana      5  3.559571
6          6        pear      6  2.051882
7          7  strawberry      5  0.979858

In [95]:
fruit_cat = df["fruit"].astype("category")
fruit_cat

0         apple
1        banana
2          pear
3    strawberry
4         apple
5        banana
6          pear
7    strawberry
Name: fruit, dtype: category
Categories (4, object): ['apple', 'banana', 'pear', 'strawberry']

In [96]:
fruit_cat.array

['apple', 'banana', 'pear', 'strawberry', 'apple', 'banana', 'pear', 'strawberry']
Categories (4, object): ['apple', 'banana', 'pear', 'strawberry']

In [97]:
fruit_cat.array.codes

array([0, 1, 2, 3, 0, 1, 2, 3], dtype=int8)

In [98]:
fruit_cat.array.categories

Index(['apple', 'banana', 'pear', 'strawberry'], dtype='object')

In [99]:
dict(enumerate(fruit_cat.cat.categories))

{0: 'apple', 1: 'banana', 2: 'pear', 3: 'strawberry'}

In [100]:
df["fruit"] = df["fruit"].astype("category")
df["fruit"]

0         apple
1        banana
2          pear
3    strawberry
4         apple
5        banana
6          pear
7    strawberry
Name: fruit, dtype: category
Categories (4, object): ['apple', 'banana', 'pear', 'strawberry']

In [101]:
my_categories = pd.Categorical(["foo", "bar", "baz", "foo", "bar"])
my_categories

['foo', 'bar', 'baz', 'foo', 'bar']
Categories (3, object): ['bar', 'baz', 'foo']

In [102]:
categories = ["foo", "bar", "baz"]
codes = [0, 1, 2, 0, 1]
my_cats_2 = pd.Categorical.from_codes(codes, categories)
my_cats_2

['foo', 'bar', 'baz', 'foo', 'bar']
Categories (3, object): ['foo', 'bar', 'baz']

In [103]:
rng = np.random.default_rng(seed=123)
draws = rng.standard_normal(1000)
draws[:5]

array([-0.98912135, -0.36778665,  1.28792526,  0.19397442,  0.9202309 ])

In [104]:
bins = pd.qcut(draws, 4)
bins

[(-3.299, -0.623], (-0.623, 0.0419], (0.737, 3.058], (0.0419, 0.737], (0.737, 3.058], ..., (-3.299, -0.623], (0.0419, 0.737], (0.0419, 0.737], (-3.299, -0.623], (0.0419, 0.737]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.299, -0.623] < (-0.623, 0.0419] < (0.0419, 0.737] < (0.737, 3.058]]

In [105]:
bins = pd.qcut(draws, 4, labels=["Q1", "Q2", "Q3", "Q4"])
bins

['Q1', 'Q2', 'Q4', 'Q3', 'Q4', ..., 'Q1', 'Q3', 'Q3', 'Q1', 'Q3']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [107]:
bins = pd.Series(bins, name="quartile")
results = (pd.Series(draws).groupby(bins).agg(["count", "min", "max"]).reset_index())
results

/var/folders/7v/zmfj4myd5gj8ttpbq6ynmdm80000gn/T/ipykernel_76290/3535089692.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  results = (pd.Series(draws).groupby(bins).agg(["count", "min", "max"]).reset_index())

  quartile  count       min       max
0       Q1    250 -3.298281 -0.626241
1       Q2    250 -0.622043  0.040753
2       Q3    250  0.043084  0.736086
3       Q4    250  0.738013  3.058244

In [110]:
N = 10_000_000
labels = pd.Series(["foo", "bar", "baz", "qux"] * (N // 4))
categories = labels.astype("category")
labels.memory_usage(deep=True)

600000128

In [111]:
categories.memory_usage(deep=True)

10000540

In [112]:
%time _ = labels.astype("category")

CPU times: user 194 ms, sys: 32.5 ms, total: 226 ms
Wall time: 224 ms

In [114]:
%timeit labels.value_counts()

186 ms ± 7.81 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

In [115]:
%timeit categories.value_counts()

25.4 ms ± 192 μs per loop (mean ± std. dev. of 7 runs, 10 loops each)